Autodesk.Revit.TransformAPIUtils.CreateReflection(Autodesk.Revit.DB.Plane)
Creates a transform that represents a reflection across the given plane.
plane:
The plane.
Returns:
The new transform.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2014

Autodesk.Revit.TransformAPIUtils.CreateRotationAtPoint(Autodesk.Revit.DB.XYZ,System.Double,Autodesk.Revit.DB.XYZ)
Creates a transform that represents a rotation about the given axis at the specified point.
axis:
The rotation axis.
angle:
The angle.
origin:
The origin point.
Returns:
The new transform.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The given value for angle is not finite
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
axis has zero length.
Since:
2014

Autodesk.Revit.TransformAPIUtils.CreateRotation(Autodesk.Revit.DB.XYZ,System.Double)
Creates a transform that represents a rotation about the given axis at (0, 0, 0).
axis:
The rotation axis.
angle:
The angle.
Returns:
The new transform.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The given value for angle is not finite
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
axis has zero length.
Since:
2014

Autodesk.Revit.TransformAPIUtils.CreateTranslation(Autodesk.Revit.DB.XYZ)
Creates a transform that represents a translation via the specified vector.
vector:
The translation vector.
Returns:
The new transform.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2014